org/2020-05-30-mapping-parallel-side-effects.org
#+TITLE: Idiomatic Clojure: Mixing Parallel Side Effects and Iteration

#+OPTIONS: toc:nil num:nil
#+BEGIN_EXPORT html
---
layout: post
title: "Idiomatic Clojure: Mixing Parallel Side Effects and Iteration"
permalink: /:title/
tags: [clojure, transducers, "side effects", performance, "idiomatic clojure"]
categories: [clojure, transducers, "side effects", "idiomatic clojure"]
---
#+END_EXPORT

It is often said one should not offer criticism without suggesting an
alternative.

In a [[https://bsless.github.io/side-effects/][previous post]] which dealt with the idiomatic ways of mixing side
effects and iteration in Clojure, I mentioned ~pmap~ is a bad option for
performing side effects in parallel.

Since I'm not paid highly enough to just offer my criticism and let
others figure it out by themselves, I'll explain in this post why ~pmap~
should be avoided for side effects, and what other alternatives are out
there for effective (and Effective) multi-threaded programming in
Clojure

* Before We Begin

  This time just waving hands with ~api-call!~ wouldn't suffice, so
  we'll fake one to use in our examples:

  #+begin_src clojure
    (defn api-call!
      [x]
      (Thread/sleep 2000)
      (println x)
      x)
  #+end_src

  It does side effects, blocks and returns a value. Everything we need
  to make an interesting function.

  Requirements:

  #+begin_src clojure
    '{:deps
     {org.clojure/core.async {:mvn/version "RELEASE"}
      org.clojure/clojure {:mvn/version "RELEASE"}
      manifold {:mvn/version "RELEASE"}
      funcool/promesa {:mvn/version "RELEASE"}
      tolitius/lasync {:mvn/version "RELEASE"}
      com.climate/claypool {:mvn/version "RELEASE"}}}
  #+end_src

* But Why Not ~pmap~?

  ~pmap~ is easy, accessible, and understandable.

  If it's so easy, why shouldn't we use it?

  skip to the [[~pmap~ TL;DR][TL;DR]] if you don't want to read the analysis.

  To understand, try to answer the following questions:
  - what happens when you evaluate the following expression?
  - when will it happen?
  - on which threads?
  - what is the value of ~xs~?

  #+begin_src clojure
    (def xs (pmap api-call! (range 128)))

    (time
     (reduce + 0 (pmap api-call! (range 128))))

    (/ 128 8) ;; => 16


    (time
     (run! println (pmap api-call! (range 512))))

    (/ 512 32) ;; => 16
  #+end_src

  The answers to these questions are fundamental in our understanding of
  why ~pmap~ is a bad choice for performing side effects. We lack
  control over important parameters (when, where) which are critical
  when performing side effects.

** What happens when you ~pmap~?

   This is what gets printed out:

   #+begin_src
    1
    2019
    27
    14
    5
    16
    10
    80
    6
    4
    13
    7
    11
    29
    12
    31
    15
    9
    17
    2
    28
    18
    21
    3
    25

    24
    23
    26
    22
    30



   #+end_src

   What are we seeing?

   First, it's important to understand an implementation detail which
   concerns lazy sequences in Clojure: They are realized in chunks of 32
   elements at a time.

   Since ~pmap~ is lazy, a chunk was realized. But if you'll notice, it
   didn't take 64 seconds, although each api call takes ~2 seconds.

   That is because ~pmap~ creates a ~future~ for *every element in the
   sequence*:

   #+begin_src clojure
     (map #(future (f %)) coll)
   #+end_src

   Another subtlety is that ~pmap~ is "semi" lazy, in that it tries to
   stay realize ~availableProcessors~ +2 elements ahead.

** When?

   Hard to tell, ~pmap~ will give it a good try to stay ahead of your
   computation, but what happens when you use ~pmap~ in too many places
   in your code in parallel? The answer to that is not so deterministic.

** On Which Thread?

   ~pmap~ uses ~future~ which uses agents' ~soloExecutor~ service, which
   is a cached thread pool.

   What does it mean in layman's terms? We can't know on which thread it
   happens, or on how many. In I think it's safe to assume each ~pmap~
   call will use ~availableProcessors~ +2 threads. What happens if you
   call it twice in close succession?

   This also complicates exception handling and the option of providing
   a default handler.

** The value of ~xs~

   The value of ~xs~ will change in time and in execution, as it will
   block while the rest of the lazy sequence materializes.

** ~pmap~ TL;DR

   ~pmap~ is great for computation since it provides a high degree of
   semi-lazy parallelism, however, since it is lazy, lacks control over
   execution context (threads number, exception handling, back pressure)
   it is unsuitable for performing side effects where these issues can
   make or break a system.

