_posts/2020-05-30-mapping-parallel-side-effects.html
---
layout: post
title: "Idiomatic Clojure: Mixing Parallel Side Effects and Iteration"
permalink: /:title/
tags: [clojure, transducers, "side effects", performance, "idiomatic clojure"]
categories: [clojure, transducers, "side effects", "idiomatic clojure"]
---

<p>
It is often said one should not offer criticism without suggesting an
alternative.
</p>

<p>
In a <a href="https://bsless.github.io/side-effects/">previous post</a> which dealt with the idiomatic ways of mixing side
effects and iteration in Clojure, I mentioned <code>pmap</code> is a bad option for
performing side effects in parallel.
</p>

<p>
Since I'm not paid highly enough to just offer my criticism and let
others figure it out by themselves, I'll explain in this post why <code>pmap</code>
should be avoided for side effects, and what other alternatives are out
there for effective (and Effective) multi-threaded programming in
Clojure
</p>

<div id="outline-container-org3ce8b78" class="outline-2">
<h2 id="org3ce8b78">Before We Begin</h2>
<div class="outline-text-2" id="text-org3ce8b78">
<p>
This time just waving hands with <code>api-call!</code> wouldn't suffice, so
we'll fake one to use in our examples:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">api-call!</span>
  <span style="color: #6c3163;">[</span>x<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">Thread</span>/sleep <span style="color: #4e3163;">2000</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>println x<span style="color: #6c3163;">)</span>
  x<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
It does side effects, blocks and returns a value. Everything we need
to make an interesting function.
</p>

<p>
Requirements:
</p>

<div class="org-src-container">
<pre class="src src-clojure">'<span style="color: #3a81c3;">{</span><span style="color: #4e3163;">:deps</span>
 <span style="color: #6c3163;">{</span><span style="color: #ba2f59; font-weight: bold;">org.clojure</span>/core.async <span style="color: #2d9574;">{</span><span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">mvn</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">version</span> <span style="color: #2d9574;">"RELEASE"</span><span style="color: #2d9574;">}</span>
  <span style="color: #ba2f59; font-weight: bold;">org.clojure</span>/clojure <span style="color: #2d9574;">{</span><span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">mvn</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">version</span> <span style="color: #2d9574;">"RELEASE"</span><span style="color: #2d9574;">}</span>
  manifold <span style="color: #2d9574;">{</span><span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">mvn</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">version</span> <span style="color: #2d9574;">"RELEASE"</span><span style="color: #2d9574;">}</span>
  <span style="color: #ba2f59; font-weight: bold;">funcool</span>/promesa <span style="color: #2d9574;">{</span><span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">mvn</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">version</span> <span style="color: #2d9574;">"RELEASE"</span><span style="color: #2d9574;">}</span>
  <span style="color: #ba2f59; font-weight: bold;">tolitius</span>/lasync <span style="color: #2d9574;">{</span><span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">mvn</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">version</span> <span style="color: #2d9574;">"RELEASE"</span><span style="color: #2d9574;">}</span>
  <span style="color: #ba2f59; font-weight: bold;">com.climate</span>/claypool <span style="color: #2d9574;">{</span><span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">mvn</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">version</span> <span style="color: #2d9574;">"RELEASE"</span><span style="color: #2d9574;">}</span><span style="color: #6c3163;">}</span><span style="color: #3a81c3;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7c6d159" class="outline-2">
<h2 id="org7c6d159">But Why Not <code>pmap</code>?</h2>
<div class="outline-text-2" id="text-org7c6d159">
<p>
<code>pmap</code> is easy, accessible, and understandable.
</p>

<p>
If it's so easy, why shouldn't we use it?
</p>

<p>
skip to the <a href="#orga7141f8">TL;DR</a> if you don't want to read the analysis.
</p>

<p>
To understand, try to answer the following questions:
</p>
<ul class="org-ul">
<li>what happens when you evaluate the following expression?</li>
<li>when will it happen?</li>
<li>on which threads?</li>
<li>what is the value of <code>xs</code>?</li>
</ul>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">xs</span> <span style="color: #6c3163;">(</span>pmap api-call! <span style="color: #2d9574;">(</span>range <span style="color: #4e3163;">128</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>time
 <span style="color: #6c3163;">(</span>reduce + <span style="color: #4e3163;">0</span> <span style="color: #2d9574;">(</span>pmap api-call! <span style="color: #67b11d;">(</span>range <span style="color: #4e3163;">128</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>/ <span style="color: #4e3163;">128</span> <span style="color: #4e3163;">8</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; 16</span>


<span style="color: #3a81c3;">(</span>time
 <span style="color: #6c3163;">(</span>run! println <span style="color: #2d9574;">(</span>pmap api-call! <span style="color: #67b11d;">(</span>range <span style="color: #4e3163;">512</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>/ <span style="color: #4e3163;">512</span> <span style="color: #4e3163;">32</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; 16</span>
</pre>
</div>

<p>
The answers to these questions are fundamental in our understanding of
why <code>pmap</code> is a bad choice for performing side effects. We lack
control over important parameters (when, where) which are critical
when performing side effects.
</p>
</div>

<div id="outline-container-org16da937" class="outline-3">
<h3 id="org16da937">What happens when you <code>pmap</code>?</h3>
<div class="outline-text-3" id="text-org16da937">
<p>
This is what gets printed out:
</p>

<pre class="example">
1
2019
27
14
5
16
10
80
6
4
13
7
11
29
12
31
15
9
17
2
28
18
21
3
25

24
23
26
22
30



</pre>

<p>
What are we seeing?
</p>

<p>
First, it's important to understand an implementation detail which
concerns lazy sequences in Clojure: They are realized in chunks of 32
elements at a time.
</p>

<p>
Since <code>pmap</code> is lazy, a chunk was realized. But if you'll notice, it
didn't take 64 seconds, although each api call takes ~2 seconds.
</p>

<p>
That is because <code>pmap</code> creates a <code>future</code> for <b>every element in the
sequence</b>:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span>map #<span style="color: #6c3163;">(</span>future <span style="color: #2d9574;">(</span>f <span style="color: #715ab1;">%</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span> coll<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Another subtlety is that <code>pmap</code> is "semi" lazy, in that it tries to
stay realize <code>availableProcessors</code> +2 elements ahead.
</p>
</div>
</div>

<div id="outline-container-orgce0fd71" class="outline-3">
<h3 id="orgce0fd71">When?</h3>
<div class="outline-text-3" id="text-orgce0fd71">
<p>
Hard to tell, <code>pmap</code> will give it a good try to stay ahead of your
computation, but what happens when you use <code>pmap</code> in too many places
in your code in parallel? The answer to that is not so deterministic.
</p>
</div>
</div>

<div id="outline-container-orgdfeb9e3" class="outline-3">
<h3 id="orgdfeb9e3">On Which Thread?</h3>
<div class="outline-text-3" id="text-orgdfeb9e3">
<p>
<code>pmap</code> uses <code>future</code> which uses agents' <code>soloExecutor</code> service, which
is a cached thread pool.
</p>

<p>
What does it mean in layman's terms? We can't know on which thread it
happens, or on how many. In I think it's safe to assume each <code>pmap</code>
call will use <code>availableProcessors</code> +2 threads. What happens if you
call it twice in close succession?
</p>

<p>
This also complicates exception handling and the option of providing
a default handler.
</p>
</div>
</div>

<div id="outline-container-orgc59c751" class="outline-3">
<h3 id="orgc59c751">The value of <code>xs</code></h3>
<div class="outline-text-3" id="text-orgc59c751">
<p>
The value of <code>xs</code> will change in time and in execution, as it will
block while the rest of the lazy sequence materializes.
</p>
</div>
</div>

<div id="outline-container-orga7141f8" class="outline-3">
<h3 id="orga7141f8"><code>pmap</code> TL;DR</h3>
<div class="outline-text-3" id="text-orga7141f8">
<p>
<code>pmap</code> is great for computation since it provides a high degree of
semi-lazy parallelism, however, since it is lazy, lacks control over
execution context (threads number, exception handling, back pressure)
it is unsuitable for performing side effects where these issues can
make or break a system.
</p>
</div>
</div>
</div>
