org/2020-05-30-mapping-parallel-side-effects.org
* Executors

  One of the most straightforward options is using
  ~java.util.concurrent.Executors~. Executors are flexible, support
  different policies, and are highly configurable. The below example is
  rather simple, but demonstrates how easy it is to get started with
  them.

** Unbounded Queue

   #+begin_src clojure
     (import '[java.util.concurrent Executors ExecutorService])

     (defn fixed-pool
       ([n]
        (Executors/newFixedThreadPool n))
       ([n factory]
        (Executors/newFixedThreadPool n factory)))

     (defonce default-pool (delay (Executors/newFixedThreadPool 2)))

     (defn submit*
       [pool f]
       (.submit ^ExecutorService pool ^Callable f))

     (defmacro submit
       [pool & body]
       `(submit* ~pool (fn* [] ~@body)))

     (defn pmap*
       ([f xs]
        (pmap* @default-pool f xs))
       ([pool f xs]
        (->> xs
             (mapv #(submit pool (f %)))
             (mapv deref))))

     (pmap* (fixed-pool 2) api-call! (vec (range 10)))
   #+end_src

   For a slightly different example, see [[https://github.com/clojure/core.async/blob/master/src/main/clojure/clojure/core/async/impl/exec/threadpool.clj][core.async]]'s implementation.

** Blocking Queue

   One glaring deficiency in the previous example is the lack of back
   pressure, which could lead to us blowing the heap up with enqueued tasks.

   Using others' implementation is no shame, so let's have a look at
   [[https://github.com/tolitius/lasync][tolitius/lasync]]

   As stated in the README, the purpose of the library is to be able to
   block on ~.submit~ and ~.execute~, which is exactly the issue we saw
   in the previous implementation.

   ~lasync/pool~ returns a ~ThreadPoolExecutor~ so it plugs right in to
   our ~pmap*~ implementation.

   #+begin_src clojure
     (require '[lasync.core :as lasync])

     (def pool (lasync/pool :threads 2))

     (pmap* pool api-call! (range 10))
   #+end_src

** Alternative implementations

   If you don't want to implement anything yourself, including ~pmap~,
   and perhaps need a richer API, which for example doesn't guarantee
   ordering, or supports parallel list comprehensions (~for~), take a
   look at [[https://github.com/TheClimateCorporation/claypoole][TheClimateCorporation/claypoole]]

   Usage is very straightforward:

   #+begin_src clojure
     (require '[com.climate.claypoole :as cp])
     (def pool (cp/threadpool 4))
     (def output (cp/pmap pool api-call! (range 64)))
   #+end_src

* core.async

  Same solutions which used the executor can be implemented with
  different abstractions and contexts. An interesting one is core.async,
  which allows us to use pipelines for sequence processing. If we look
  at each batch as a sequence, the following implementation arises
  naturally:

