_posts/2020-05-30-mapping-parallel-side-effects.html

<div id="outline-container-orga6df3b2" class="outline-2">
<h2 id="orga6df3b2">Executors</h2>
<div class="outline-text-2" id="text-orga6df3b2">
<p>
One of the most straightforward options is using
<code>java.util.concurrent.Executors</code>. Executors are flexible, support
different policies, and are highly configurable. The below example is
rather simple, but demonstrates how easy it is to get started with
them.
</p>
</div>

<div id="outline-container-org545c5a6" class="outline-3">
<h3 id="org545c5a6">Unbounded Queue</h3>
<div class="outline-text-3" id="text-org545c5a6">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span>import '<span style="color: #6c3163;">[</span>java.util.concurrent Executors ExecutorService<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">fixed-pool</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span>n<span style="color: #2d9574;">]</span>
   <span style="color: #2d9574;">(</span><span style="color: #ba2f59; font-weight: bold;">Executors</span>/newFixedThreadPool n<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span>n factory<span style="color: #2d9574;">]</span>
   <span style="color: #2d9574;">(</span><span style="color: #ba2f59; font-weight: bold;">Executors</span>/newFixedThreadPool n factory<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defonce</span> <span style="color: #715ab1;">default-pool</span> <span style="color: #6c3163;">(</span>delay <span style="color: #2d9574;">(</span><span style="color: #ba2f59; font-weight: bold;">Executors</span>/newFixedThreadPool <span style="color: #4e3163;">2</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">submit*</span>
  <span style="color: #6c3163;">[</span>pool f<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span>.submit <span style="color: #655370; background-color: #fbf8ef;">^</span><span style="color: #ba2f59; font-weight: bold;">ExecutorService</span> pool <span style="color: #655370; background-color: #fbf8ef;">^</span><span style="color: #ba2f59; font-weight: bold;">Callable</span> f<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defmacro</span> <span style="color: #6c3163; font-weight: bold;">submit</span>
  <span style="color: #6c3163;">[</span>pool &amp; body<span style="color: #6c3163;">]</span>
  `<span style="color: #6c3163;">(</span>submit* ~pool <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">fn*</span> <span style="color: #67b11d;">[]</span> ~@body<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">pmap*</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span>f xs<span style="color: #2d9574;">]</span>
   <span style="color: #2d9574;">(</span>pmap* @default-pool f xs<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span>pool f xs<span style="color: #2d9574;">]</span>
   <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">-&gt;&gt;</span> xs
        <span style="color: #67b11d;">(</span>mapv #<span style="color: #b1951d;">(</span>submit pool <span style="color: #3a81c3;">(</span>f <span style="color: #715ab1;">%</span><span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
        <span style="color: #67b11d;">(</span>mapv deref<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>pmap* <span style="color: #6c3163;">(</span>fixed-pool <span style="color: #4e3163;">2</span><span style="color: #6c3163;">)</span> api-call! <span style="color: #6c3163;">(</span>vec <span style="color: #2d9574;">(</span>range <span style="color: #4e3163;">10</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
For a slightly different example, see <a href="https://github.com/clojure/core.async/blob/master/src/main/clojure/clojure/core/async/impl/exec/threadpool.clj">core.async</a>'s implementation.
</p>
</div>
</div>

<div id="outline-container-org7bd3d16" class="outline-3">
<h3 id="org7bd3d16">Blocking Queue</h3>
<div class="outline-text-3" id="text-org7bd3d16">
<p>
One glaring deficiency in the previous example is the lack of back
pressure, which could lead to us blowing the heap up with enqueued tasks.
</p>

<p>
Using others' implementation is no shame, so let's have a look at
<a href="https://github.com/tolitius/lasync">tolitius/lasync</a>
</p>

<p>
As stated in the README, the purpose of the library is to be able to
block on <code>.submit</code> and <code>.execute</code>, which is exactly the issue we saw
in the previous implementation.
</p>

<p>
<code>lasync/pool</code> returns a <code>ThreadPoolExecutor</code> so it plugs right in to
our <code>pmap*</code> implementation.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span>require '<span style="color: #6c3163;">[</span>lasync.core <span style="color: #4e3163;">:as</span> lasync<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">pool</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">lasync</span>/pool <span style="color: #4e3163;">:threads</span> <span style="color: #4e3163;">2</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>pmap* pool api-call! <span style="color: #6c3163;">(</span>range <span style="color: #4e3163;">10</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orged53369" class="outline-3">
<h3 id="orged53369">Alternative implementations</h3>
<div class="outline-text-3" id="text-orged53369">
<p>
If you don't want to implement anything yourself, including <code>pmap</code>,
and perhaps need a richer API, which for example doesn't guarantee
ordering, or supports parallel list comprehensions (<code>for</code>), take a
look at <a href="https://github.com/TheClimateCorporation/claypoole">TheClimateCorporation/claypoole</a>
</p>

<p>
Usage is very straightforward:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span>require '<span style="color: #6c3163;">[</span>com.climate.claypoole <span style="color: #4e3163;">:as</span> cp<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">pool</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">cp</span>/threadpool <span style="color: #4e3163;">4</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">output</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">cp</span>/pmap pool api-call! <span style="color: #2d9574;">(</span>range <span style="color: #4e3163;">64</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org22d4763" class="outline-2">
<h2 id="org22d4763">core.async</h2>
<div class="outline-text-2" id="text-org22d4763">
<p>
Same solutions which used the executor can be implemented with
different abstractions and contexts. An interesting one is core.async,
which allows us to use pipelines for sequence processing. If we look
at each batch as a sequence, the following implementation arises
naturally:
</p>
</div>
