org/2020-05-30-mapping-parallel-side-effects.org
** pipeline

   #+begin_src clojure
     (require '[clojure.core.async :as async])

     (defn parallel
       "Returns a channel which will contain a transient vector of results"
       ([n f xs]
        (parallel nil n f xs))
       ([buf-or-n n f xs]
        (let [out (async/chan)]
          (async/pipeline-blocking
           n
           out
           (map f)
           (async/to-chan xs))
          (async/reduce conj! (transient []) out))))


     (def ch (parallel 4 api-call! (range 16)))
     (persistent! (async/<!! ch))
     ;; => [0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15]
   #+end_src

   If ~api-call!~ had been asynchronous ~pipeline-blocking~ can be
   swapped for ~pipeline-async~, and instead of a transducer:

   #+begin_src clojure
     (fn af [v c]
       (api-call!
        v
        (fn cb [res] (async/put! c res) (async/close! c))))
   #+end_src

   A slight problem with the above implementation is that it has higher
   overhead than previous ones. It allocates plenty of channels, new
   ~async/thread~ s for each call, which isn't completely terrible as it
   uses a cached thread pool, and requires working with channels all the
   way.

   It's probably a suitable solution if your entire code base is already
   written in the abstraction, otherwise I'm not sure I'd go with it.

** Thread Pool

   If you're using core.async and haven't read
   [[http://danboykis.com/posts/things-i-wish-i-knew-about-core-async/][Things I Wish I knew about core.async]] take a few extra minutes of
   your day to read it. Building off the final example in the post:

   #+begin_src clojure
     (defn async-wrapper [pool f]
       (let [ch (async/chan 1)]
         (.submit
          pool
          (fn []
            (try (async/put! ch (f))
                 (catch Exception e (async/put! ch (ex-info "some error" {} e)))
                 (finally (async/close! ch)))))
         ch))

     (defmacro asyncly
       [pool & body]
       `(async-wrapper ~pool (fn* [] ~@body)))


     (->> (range 8)
          (mapv #(asyncly @default-pool (api-call! %)))
          async/merge
          (async/reduce conj [])
          async/<!!)
     ;; => [1 0 3 2 4 5 6 7]
   #+end_src

   This example nicely ties together everything we've seen until now.
   Pay attention that it does not preserve order.

