_posts/2020-05-30-mapping-parallel-side-effects.html

<div id="outline-container-org15b1dcf" class="outline-3">
<h3 id="org15b1dcf">pipeline</h3>
<div class="outline-text-3" id="text-org15b1dcf">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span>require '<span style="color: #6c3163;">[</span>clojure.core.async <span style="color: #4e3163;">:as</span> async<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">parallel</span>
  <span style="color: #da8b55;">"Returns a channel which will contain a transient vector of results"</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span>n f xs<span style="color: #2d9574;">]</span>
   <span style="color: #2d9574;">(</span>parallel <span style="color: #4e3163;">nil</span> n f xs<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span>buf-or-n n f xs<span style="color: #2d9574;">]</span>
   <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #67b11d;">[</span>out <span style="color: #b1951d;">(</span><span style="color: #ba2f59; font-weight: bold;">async</span>/chan<span style="color: #b1951d;">)</span><span style="color: #67b11d;">]</span>
     <span style="color: #67b11d;">(</span><span style="color: #ba2f59; font-weight: bold;">async</span>/pipeline-blocking
      n
      out
      <span style="color: #b1951d;">(</span>map f<span style="color: #b1951d;">)</span>
      <span style="color: #b1951d;">(</span><span style="color: #ba2f59; font-weight: bold;">async</span>/to-chan xs<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
     <span style="color: #67b11d;">(</span><span style="color: #ba2f59; font-weight: bold;">async</span>/reduce conj! <span style="color: #b1951d;">(</span>transient <span style="color: #3a81c3;">[]</span><span style="color: #b1951d;">)</span> out<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>


<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">ch</span> <span style="color: #6c3163;">(</span>parallel <span style="color: #4e3163;">4</span> api-call! <span style="color: #2d9574;">(</span>range <span style="color: #4e3163;">16</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>persistent! <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">async</span>/&lt;!! ch<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; [0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15]</span>
</pre>
</div>

<p>
If <code>api-call!</code> had been asynchronous <code>pipeline-blocking</code> can be
swapped for <code>pipeline-async</code>, and instead of a transducer:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #6c3163; font-weight: bold;">af</span> <span style="color: #6c3163;">[</span>v c<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span>api-call!
   v
   <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #6c3163; font-weight: bold;">cb</span> <span style="color: #67b11d;">[</span>res<span style="color: #67b11d;">]</span> <span style="color: #67b11d;">(</span><span style="color: #ba2f59; font-weight: bold;">async</span>/put! c res<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span><span style="color: #ba2f59; font-weight: bold;">async</span>/close! c<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
A slight problem with the above implementation is that it has higher
overhead than previous ones. It allocates plenty of channels, new
<code>async/thread</code> s for each call, which isn't completely terrible as it
uses a cached thread pool, and requires working with channels all the
way.
</p>

<p>
It's probably a suitable solution if your entire code base is already
written in the abstraction, otherwise I'm not sure I'd go with it.
</p>
</div>
</div>

<div id="outline-container-org5b0a744" class="outline-3">
<h3 id="org5b0a744">Thread Pool</h3>
<div class="outline-text-3" id="text-org5b0a744">
<p>
If you're using core.async and haven't read
<a href="http://danboykis.com/posts/things-i-wish-i-knew-about-core-async/">Things I Wish I knew about core.async</a> take a few extra minutes of
your day to read it. Building off the final example in the post:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">async-wrapper</span> <span style="color: #6c3163;">[</span>pool f<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #2d9574;">[</span>ch <span style="color: #67b11d;">(</span><span style="color: #ba2f59; font-weight: bold;">async</span>/chan <span style="color: #4e3163;">1</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
    <span style="color: #2d9574;">(</span>.submit
     pool
     <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #b1951d;">[]</span>
       <span style="color: #b1951d;">(</span><span style="color: #3a81c3; font-weight: bold;">try</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">async</span>/put! ch <span style="color: #6c3163;">(</span>f<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
            <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">catch</span> Exception e <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">async</span>/put! ch <span style="color: #2d9574;">(</span>ex-info <span style="color: #2d9574;">"some error"</span> <span style="color: #887070;">{}</span> e<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
            <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">finally</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">async</span>/close! ch<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    ch<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defmacro</span> <span style="color: #6c3163; font-weight: bold;">asyncly</span>
  <span style="color: #6c3163;">[</span>pool &amp; body<span style="color: #6c3163;">]</span>
  `<span style="color: #6c3163;">(</span>async-wrapper ~pool <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">fn*</span> <span style="color: #67b11d;">[]</span> ~@body<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>


<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">-&gt;&gt;</span> <span style="color: #6c3163;">(</span>range <span style="color: #4e3163;">8</span><span style="color: #6c3163;">)</span>
     <span style="color: #6c3163;">(</span>mapv #<span style="color: #2d9574;">(</span>asyncly @default-pool <span style="color: #67b11d;">(</span>api-call! <span style="color: #715ab1;">%</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
     <span style="color: #ba2f59; font-weight: bold;">async</span>/merge
     <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">async</span>/reduce conj <span style="color: #2d9574;">[]</span><span style="color: #6c3163;">)</span>
     <span style="color: #ba2f59; font-weight: bold;">async</span>/&lt;!!<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; [1 0 3 2 4 5 6 7]</span>
</pre>
</div>

<p>
This example nicely ties together everything we've seen until now.
Pay attention that it does not preserve order.
</p>
</div>
</div>
</div>
