org/2020-05-30-mapping-parallel-side-effects.org
* Promesa

  Promesa is a promise library for Clojure and ClojureScript, with
  pretty light overhead.

  Promesa does not just provide facilities for concurrent execution, but
  models them as Effect types, thus providing a very human friendly
  transition between the following:

  #+begin_src haskell
    f :: [a] -> [Future<a>] -- map api-call+ [a]
    g :: [Future<a>] -> Future<[a]> -- all
    h :: Future<[a]> -> [a] -- deref
  #+end_src

  (Any Haskellers who want to shout at me or correct me for the mess I
  wrote here are welcome, I promise to correct it based on your feedback)

  See the [[https://cljdoc.org/d/funcool/promesa/5.1.0/doc/user-guide][documentation]]

  #+begin_src clojure
    (require '[promesa.core :as p] '[promesa.exec :as exec])

    (def xs (vec (range 32)))

    (defn api-call+
      [ex x]
      (p/then (p/promise x) api-call! ex))

    (def ex (exec/fixed-pool 4))

    (def p (p/all (map (partial api-call+ ex) xs)))

    @p;; => [0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31]
  #+end_src

  Promesa Just Works and has light overhead, and would be my pick in
  most use cases.

* Manifold

  Manifold's deferred abstraction is pretty similar to Promesa's
  promises, with slightly higher overhead.
  It also offers a stream abstraction which isn't necessarily relevant
  for this discussion.

  See the [[https://github.com/ztellman/manifold][documentation]]

  #+begin_src clojure
    (require '[manifold.deferred :as d]
             '[manifold.executor :as e])

    (def ex (e/fixed-thread-executor 4))

    (defn manifold-api-call
      [ex x]
      (let [d (d/deferred ex)
            c (d/chain d #(future (api-call! %)))]
        (d/success! d x)
        c))

    (def out (apply d/zip (mapv (partial manifold-api-call ex) (range 32))))
  #+end_src

* Summary

** Similarities

*** Promesa and Manifold

    both operate on deferred values, and have the option of lifting a
    sequence of deferred values into a single deferred value of the
    sequence.

** Differences

*** Monads vs. Java

    Promesa and Manifold are "up there" in a monadic world of effect
    types while the Java leaning implementations are more "just get
    things done" solutions. More mechanical.

*** core.async vs. everything else

    The core.async solutions is the most mechanical and out of the
    common abstractions which already exist in Clojure (map,
    executors).

** Retrospective

*** The Clojuriest

    Of all available solutions the most Clojure-y ones are definitely
    [[https://github.com/tolitius/lasync][tolitius/lasync]] and [[https://github.com/TheClimateCorporation/claypoole][TheClimateCorporation/claypoole]]. Claypoole
    especially provides an almost drop-in replacement for your bad code.

*** The comfiest

    I have to admit I like Promesa. The abstraction is comfortable and
    lends itself well to a code base which relies on asynchronous
    computation. It also plays well with funcool's other library,
    ~cats~, which implements category theory concepts in Clojure.
