_posts/2020-05-30-mapping-parallel-side-effects.html

<div id="outline-container-orga4aa65c" class="outline-2">
<h2 id="orga4aa65c">Promesa</h2>
<div class="outline-text-2" id="text-orga4aa65c">
<p>
Promesa is a promise library for Clojure and ClojureScript, with
pretty light overhead.
</p>

<p>
Promesa does not just provide facilities for concurrent execution, but
models them as Effect types, thus providing a very human friendly
transition between the following:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">start with</span>
<span style="color: #6c3163; font-weight: bold;">f</span> <span style="color: #715ab1;">::</span> a <span style="color: #715ab1;">-&gt;</span> b
<span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">mapping it</span>
<span style="color: #6c3163; font-weight: bold;">f'</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">[</span>a<span style="color: #3a81c3;">]</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">[</span>b<span style="color: #3a81c3;">]</span>

<span style="color: #6c3163; font-weight: bold;">f''</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">[</span>a<span style="color: #3a81c3;">]</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">Future</span> b<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">map api-call+ [a]</span>
<span style="color: #6c3163; font-weight: bold;">g</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">Future</span> b<span style="color: #3a81c3;">]</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Future</span> <span style="color: #3a81c3;">[</span>b<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">all</span>
<span style="color: #6c3163; font-weight: bold;">h</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Future</span> <span style="color: #3a81c3;">[</span>b<span style="color: #3a81c3;">]</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">[</span>b<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">deref</span>
</pre>
</div>

<p>
(Any Haskellers who want to shout at me or correct me for the mess I
wrote here are welcome, I promise to correct it based on your feedback)
</p>

<p>
See the <a href="https://cljdoc.org/d/funcool/promesa/5.1.0/doc/user-guide">documentation</a>
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span>require '<span style="color: #6c3163;">[</span>promesa.core <span style="color: #4e3163;">:as</span> p<span style="color: #6c3163;">]</span> '<span style="color: #6c3163;">[</span>promesa.exec <span style="color: #4e3163;">:as</span> exec<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">xs</span> <span style="color: #6c3163;">(</span>vec <span style="color: #2d9574;">(</span>range <span style="color: #4e3163;">32</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">api-call+</span>
  <span style="color: #6c3163;">[</span>ex x<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">p</span>/then <span style="color: #2d9574;">(</span><span style="color: #ba2f59; font-weight: bold;">p</span>/promise x<span style="color: #2d9574;">)</span> api-call! ex<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">ex</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">exec</span>/fixed-pool <span style="color: #4e3163;">4</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">p</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">p</span>/all <span style="color: #2d9574;">(</span>map <span style="color: #67b11d;">(</span>partial api-call+ ex<span style="color: #67b11d;">)</span> xs<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

@p<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; [0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31]</span>
</pre>
</div>

<p>
Promesa Just Works and has light overhead, and would be my pick in
most use cases.
</p>
</div>
</div>

<div id="outline-container-orgc203447" class="outline-2">
<h2 id="orgc203447">Manifold</h2>
<div class="outline-text-2" id="text-orgc203447">
<p>
Manifold's deferred abstraction is pretty similar to Promesa's
promises, with slightly higher overhead.
It also offers a stream abstraction which isn't necessarily relevant
for this discussion.
</p>

<p>
See the <a href="https://github.com/ztellman/manifold">documentation</a>
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span>require '<span style="color: #6c3163;">[</span>manifold.deferred <span style="color: #4e3163;">:as</span> d<span style="color: #6c3163;">]</span>
         '<span style="color: #6c3163;">[</span>manifold.executor <span style="color: #4e3163;">:as</span> e<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">ex</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">e</span>/fixed-thread-executor <span style="color: #4e3163;">4</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">manifold-api-call</span>
  <span style="color: #6c3163;">[</span>ex x<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #2d9574;">[</span>d <span style="color: #67b11d;">(</span><span style="color: #ba2f59; font-weight: bold;">d</span>/<span style="color: #3a81c3; font-weight: bold;">deferred</span> <span style="color: #6c3163; font-weight: bold;">ex</span><span style="color: #67b11d;">)</span>
        c <span style="color: #67b11d;">(</span><span style="color: #ba2f59; font-weight: bold;">d</span>/chain d #<span style="color: #b1951d;">(</span>future <span style="color: #3a81c3;">(</span>api-call! <span style="color: #715ab1;">%</span><span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
    <span style="color: #2d9574;">(</span><span style="color: #ba2f59; font-weight: bold;">d</span>/success! d x<span style="color: #2d9574;">)</span>
    c<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">out</span> <span style="color: #6c3163;">(</span>apply <span style="color: #ba2f59; font-weight: bold;">d</span>/zip <span style="color: #2d9574;">(</span>mapv <span style="color: #67b11d;">(</span>partial manifold-api-call ex<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>range <span style="color: #4e3163;">32</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org988b679" class="outline-2">
<h2 id="org988b679">Summary</h2>
<div class="outline-text-2" id="text-org988b679">
</div>
<div id="outline-container-orgb9a7587" class="outline-3">
<h3 id="orgb9a7587">Similarities</h3>
<div class="outline-text-3" id="text-orgb9a7587">
</div>
<div id="outline-container-orgdf5467b" class="outline-4">
<h4 id="orgdf5467b">Promesa and Manifold</h4>
<div class="outline-text-4" id="text-orgdf5467b">
<p>
both operate on deferred values, and have the option of lifting a
sequence of deferred values into a single deferred value of the
sequence.
</p>
</div>
</div>
</div>

<div id="outline-container-org1c9051c" class="outline-3">
<h3 id="org1c9051c">Differences</h3>
<div class="outline-text-3" id="text-org1c9051c">
</div>
<div id="outline-container-orga211fc6" class="outline-4">
<h4 id="orga211fc6">Monads vs. Java</h4>
<div class="outline-text-4" id="text-orga211fc6">
<p>
Promesa and Manifold are "up there" in a monadic world of effect
types while the Java leaning implementations are more "just get
things done" solutions. More mechanical.
</p>
</div>
</div>

<div id="outline-container-orgcba7e14" class="outline-4">
<h4 id="orgcba7e14">core.async vs. everything else</h4>
<div class="outline-text-4" id="text-orgcba7e14">
<p>
The core.async solutions is the most mechanical and out of the
common abstractions which already exist in Clojure (map,
executors).
</p>
</div>
</div>
</div>

<div id="outline-container-org8f483f1" class="outline-3">
<h3 id="org8f483f1">Retrospective</h3>
<div class="outline-text-3" id="text-org8f483f1">
</div>
<div id="outline-container-orge8286aa" class="outline-4">
<h4 id="orge8286aa">The Clojuriest</h4>
<div class="outline-text-4" id="text-orge8286aa">
<p>
Of all available solutions the most Clojure-y ones are definitely
<a href="https://github.com/tolitius/lasync">tolitius/lasync</a> and <a href="https://github.com/TheClimateCorporation/claypoole">TheClimateCorporation/claypoole</a>. Claypoole
especially provides an almost drop-in replacement for your bad code.
</p>

<p>
This should probably be your go-to option when trying to clean up
any misuses of <code>pmap</code>, <code>doall</code>, or any other idiosyncrasies.
</p>
</div>
</div>

<div id="outline-container-org6c905ef" class="outline-4">
<h4 id="org6c905ef">The comfiest</h4>
<div class="outline-text-4" id="text-org6c905ef">
<p>
I have to admit I like Promesa. The abstraction is comfortable and
lends itself well to a code base which relies on asynchronous
computation. It also plays well with funcool's other library,
<code>cats</code>, which implements category theory concepts in Clojure.
</p>
</div>
</div>
</div>
</div>
